toastmanAu/wyEspAgentPay/example/sdkconfig.defaults
# ESP32-P4 config
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# WiFi config (example app needs these)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7

# Example app config
CONFIG_EXAMPLE_WIFI_SSID="your_ssid"
CONFIG_EXAMPLE_WIFI_PASS="your_password"
CONFIG_EXAMPLE_FIBER_RPC_URL="http://192.168.68.105:8227"
CONFIG_EXAMPLE_TARGET_URL="http://httpbin.org/status/402"
